3. Write python code for indexing rows and columns based on the following conditions:
   Assume we have the following dataframe:

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {'name': ['Alice', 'Bob', 'Charlie', 'Dave'],

        'age': [25, 35, 40, 28],

        'gender': ['F', 'M', 'M', 'M'],

        'salary': [50000, 70000, 60000, 80000]}

In [4]:
df = pd.DataFrame(data)
df

      name  age gender  salary
0    Alice   25      F   50000
1      Bob   35      M   70000
2  Charlie   40      M   60000
3     Dave   28      M   80000

1. Select rows where age is greater than 30:

In [5]:
df[df['age']>30]

      name  age gender  salary
1      Bob   35      M   70000
2  Charlie   40      M   60000

2. Select rows where name contains 'e':

In [6]:
df[df['name'].str.contains('e')]

      name  age gender  salary
0    Alice   25      F   50000
2  Charlie   40      M   60000
3     Dave   28      M   80000

3. Select rows where gender is 'M' and salary is greater than 65000:

In [7]:
df[df['gender'].str.contains('M')&(df['salary']>65000)]

   name  age gender  salary
1   Bob   35      M   70000
3  Dave   28      M   80000

4. Select columns 'name' and 'age'

In [9]:
df[['name','age']]

      name  age
0    Alice   25
1      Bob   35
2  Charlie   40
3     Dave   28

5. Select columns 'name' and 'salary' where age is less than or equal to 30:

In [11]:
df[df['age']<=30][['name','salary']]

    name  salary
0  Alice   50000
3   Dave   80000